# TriOrQuadFacet Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TriOrQuadFacet Methods
TriOrQuadFacet Class See Also
---
The TriOrQuadFacet type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetVertexIndex | Returns the index of the specified vertex of this facet (as an index into the external array of vertices in the TriangulationInterface that was used to create the list of TriOrQuadFacets). |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
TriOrQuadFacet Class
Autodesk.Revit.DB Namespace